export const LOL_TIER = [
  { value: 'UNRANKED', name: '언랭크' },
  { value: 'IRON', name: '아이언' },
  { value: 'BRONZE', name: '브론즈' },
  { value: 'SILVER', name: '실버' },
  { value: 'GOLD', name: '골드' },
  { value: 'PLATINUM', name: '플래티넘' },
  { value: 'DIAMOND', name: '다이아' },
  { value: 'MASTER', name: '마스터' },
  { value: 'GRANDMASTER', name: '그랜드마스터' },
  { value: 'CHALLENGER', name: '챌린저' },
];

export const OVERWATCH_TIER = [
  { value: 'UNRANKED', name: '언랭크' },
  { value: 'BRONZE', name: '브론즈' },
  { value: 'SILVER', name: '실버' },
  { value: 'GOLD', name: '골드' },
  { value: 'PLATINUM', name: '플래티넘' },
  { value: 'DIAMOND', name: '다이아' },
  { value: 'MASTER', name: '마스터' },
  { value: 'GRANDMASTER', name: '그랜드마스터' },
  { value: 'RANKER', name: '랭커' },
];

export const PUBG_TIER = [
  { value: 'UNRANKED', name: '언랭크' },
  { value: 'BRONZE', name: '브론즈' },
  { value: 'SILVER', name: '실버' },
  { value: 'GOLD', name: '골드' },
  { value: 'PLATINUM', name: '플래티넘' },
  { value: 'DIAMOND', name: '다이아' },
  { value: 'MASTER', name: '마스터' },
];

export const registerText = [
  `1. 당사와의 관계
WATPL (이하 통칭하여 “WATPL” 또는 “당사“)이 제공하는 WATPL (이하 “본 플랫폼“)에 오신 것을 환영합니다.
본 약관은 당사 관련 웹사이트, 서비스, 어플리케이션, 제품 및 콘텐츠(이하 통칭하여 “본 서비스“) 이용을 위하여 귀하와 당사의 관계를 규정하는 서비스약관(이하 “본 약관“)입니다. 당사의 본 서비스는 사적이고 비상업적인 목적을 위하여 제공됩니다. 본 약관에서 “귀하“란 귀하와 기타 본 서비스 이용자들을 지칭합니다.
본 약관은 귀하와 당사 사이의 법적 효력이 있는 계약입니다. 이하 내용은 충분한 시간을 가지고 주의 깊게 읽어주십시오.
본 약관은 중재 조항 및 당사를 상대로 하는 집단소송 제기권의 포기를 포함하고 있습니다. 위 중재 조항에 언급된 특정 유형의 분쟁을 제외하고, 귀하와 WATPL은 양 당사자들간의 분쟁을 강제적이고 구속력 있는 중재로 해결하며, 귀하와 WATPL은 집단소송 또는 집단적 중재에 참여할 권리를 포기하는 것에 동의합니다.
2. 약관의 동의
본 약관은 귀하가 본 약관에 동의하고 관련 서비스 이용 요청을 전송하여 당사가 해당 요청을 수락하면 효력이 발생합니다. 또한 당사 서비스에 접근하고 이를 이용하는 경우, 당사 커뮤니티 가이드라인 및 커뮤니티 정책을 준수하여야 하며, 이는 본 플랫폼에서 직접 확인하시거나 본 플랫폼을 다운로드할 수 있는 곳, 모바일 기기의 관련 앱 스토어에서 확인하실 수 있으며, 본 약관에도 참조로 포함되어 있습니다.
하기 각 관할권의 이용자들에게 해당하는 추가 약관은 귀하가 해당 약관에 동의하여 관련 서비스 이용 요청을 전송하여 당사가 해당 요청을 수락하면 효력이 발생합니다. 귀하가 본 서비스에 접속 또는 이용하는 권할 지역과 관련된 추가 약관 – 관할 지역에 따른 조항과 본 약관의 나머지 규정이 상충하는 경우, 해당 관할 지역의 추가 약관 – 관할 지역에 따른 조항이 우선합니다. 본 약관에 동의하지 않는다면, 당사의 본 서비스에 접속 또는 이를 이용하여서는 안 됩니다. 본 서비스를 이용하는 경우, 귀하는 개인정보처리방침의 규정에 동의하는 것입니다.
귀하가 회사 또는 단체를 위하여 본 서비스에 접속 또는 이를 이용하고 있다면, (a) 이하에서 “귀하“는 해당 회사 또는 단체를 포함하고 (b) 귀하는 본 약관에 구속력을 부여할 수 있는 권한을 가지고 있는 자로서, 회사 또는 단체의 수권된 대표자이며, 해당 단체를 대표하여 본 약관에 동의함을 표명하고 보증하며 (c) 귀하의 회사 또는 단체는 법적, 재정적으로 본 서비스의 접속 및 이용을 비롯하여 귀하와 직원, 대리인, 계약자 등 귀하와 관련된 사람들이 귀하의 계정에 접속하거나 이를 사용하는 것에 대하여 책임이 있습니다. 
귀하는 귀하의 향후의 서비스 접속 및 이용이 약관의 동의로 간주된다는 점에 대하여 이해하며 동의합니다.
귀하는 보관을 위하여 본 약관의 복사본을 출력하거나 저장하여야 합니다.`,
  `WATPL(이하 “본 플랫폼“)에 방문하신 것을 환영합니다.
당사는 귀하의 개인정보를 보호하고 존중하기 위해 최선의 노력을 다하고 있습니다. 본 개인정보 처리방침(이하 “본 정책“)은 당사가 귀하로부터 수집하거나 귀하가 당사에게 제공하는 개인정보에 관한 당사의 처리 방식을 설명합니다. 본 정책에 동의하지 않는 경우, 귀하는 본 플랫폼을 이용하지 않아야 합니다.
요약
당사가 어떠한 개인정보를 수집하는지
당사는 귀하가 계정을 생성하고 본 플랫폼에 콘텐츠를 업로드할 때 당사에게 제공하는 정보를 수집하고 처리합니다. 전술한 정보에는 귀하의 본 플랫폼 이용과 관련된 기술 및 행태정보가 포함됩니다. 아울러, 당사는 귀하가 계정을 생성하지 않은 상태에서 본 플랫폼과 상호작용을 하는 경우에도 쿠키를 통하여 귀하에 대한 비식별 정보를 수집합니다.
귀하의 개인정보를 어떻게 이용하는지
당사는 본 플랫폼을 귀하에게 제공하고, 나아가 본 플랫폼을 개선하고 관리하기 위해 귀하의 정보를 활용합니다. 당사는 무엇보다도 귀하에게 “For You” 피드에서 추천을 하고, 본 플랫폼을 개선하고 개발하며, 귀하의 안전을 보장하기 위한 목적으로 귀하의 정보를 이용합니다. 적절한 경우, 당사는 귀하에게 맞춤형 광고를 집행하고 본 플랫폼을 홍보하기 위해 귀하의 개인정보를 이용합니다.
당사가 누구와 귀하의 정보를 공유하는지
당사는 본 플랫폼을 제공함에 있어 도움을 주는 제3자, 즉 클라우드 서비스 제공사와 같은 제3자와 귀하의 정보를 공유합니다. 또한, 당사의 사업 파트너, WATPL과 동일한 기업집단에 속하는 회사들, 콘텐츠 심의 서비스 제공사, 측정 서비스 제공사, 광고주 및 분석 서비스 제공사와 귀하의 정보를 공유합니다. 법률에 따라 요구되는 경우, 당사는 법적으로 구속력 있는 법원명령에 따라, 사법기관, 규제당국 및 제3자와 귀하의 정보를 공유합니다.
당사가 귀하의 정보를 보유하는 기간
당사는 서비스 제공을 위하여 필요한 기간 동안 귀하의 정보를 보유합니다. 귀하에게 서비스를 제공하기 위하여 귀하의 정보를 보유할 필요가 없어지면, 당사는 해당 정보를 보관할 적법한 사업목적이 있거나 당사에게 해당 정보를 보유할 법적 의무가 있는 기간 동안에 한하여 귀하의 정보를 보유합니다. 또한, 당사는 귀하의 정보가 법적 청구의 성립, 행사 또는 방어를 위해 필요하거나 필요할 것으로 판단되는 경우 귀하의 정보를 보유합니다.`,
  `WATPL에서 이벤트 등 프로모션 알림 메일 및 푸시 알림에 대한 알림을받습니다. 언제든지 설정을 검토하고 편집 할 수 있습니다. 이러한 유형의 알림을 허용하지 않아도 WATPL 서비스 사용이 제한되지는 않습니다.
`,
];
